src/InformationRegisters/ДополнительныеНаименования/ДополнительныеНаименования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеНаименования</name>
  <comment>Наименования элементов структуры заказа и предметов снабжения на иностранном языке</comment>
  <resources>
    <name>Перевод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <comment>Предмет снабжения либо элемент структуры заказа с типом &quot;Группа&quot;</comment>
    <type>
      <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      <types>CatalogRef.ХарактеристикиКораблей</types>
      <types>CatalogRef.КатегорииЗаявокНаПоставкуПС</types>
      <types>CatalogRef.Флоты</types>
      <types>CatalogRef.ПроектыКораблей</types>
      <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Язык</name>
    <type>
      <types>CatalogRef.Языки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ГлобальныеФункцииСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль предназначен для процедур и функций, включаемых в глобальный контекст
// Веденеев П.А. 25.12.2017
////////////////////////////////////////////////////////////////////////////////

//функция возвращает перевод из регистра переводов по заданным параметрам
//при отсутствии перевода возвращает представление владельца
Функция ПолучитьПеревод(Владелец, ИмяРеквизита, Язык) Экспорт
	
	Если Язык = Справочники.Языки.Русский Тогда
		
		Возврат Строка(Владелец);
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеНаименования.Перевод КАК Перевод
	|ИЗ
	|	РегистрСведений.ДополнительныеНаименования КАК ДополнительныеНаименования
	|ГДЕ
	|	ДополнительныеНаименования.Владелец = &Владелец
	|	И ДополнительныеНаименования.ИмяРеквизита = &ИмяРеквизита
	|	И ДополнительныеНаименования.Язык = &Язык";
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ИмяРеквизита", ИмяРеквизита);
	Запрос.УстановитьПараметр("Язык", Язык);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Строка(Владелец);
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Перевод;
	
КонецФункции

//функция возвращает значение свойства владельца
//если владелец не имеет свойства с таким именем - возвращает Неопределено
Функция ПолучитьЗначениеСвойства(ВладелецСвойства, ИмяСвойства) Экспорт
	
	Структура = Новый Структура(ИмяСвойства, Неопределено);
	ЗаполнитьЗначенияСвойств(Структура, ВладелецСвойства);
	
	Возврат Структура[ИмяСвойства];
	
КонецФункции

//функция предоставляет возможность использовать метод СокрЛП() в СКД
Функция УдалитьПробелы(Строка) Экспорт
	
	Возврат СокрЛП(Строка);
	
КонецФункции
